Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/vocational_education_and_training/apprenticeships.html.txt.tmx
Source language: en
Languages: ga

source: An apprenticeship is the recognised way people are trained to become craftspeople
ga: Is é is printíseacht ann ná an bealach aitheanta ina n-oiltear daoine le bheith ina gceardaithe

source: The main craft trades have been designated by SOLAS and come within the scope of the Statutory Apprenticeship system, which is organised by SOLAS in co-operation with the Department of Education and Skills, employers and unions
ga: Tá na príomhcheirdeanna sainithe ag FÁS agus tagann siad laistigh de scóip an chórais Phrintíseachta Reachtúil, a eagraíonn SOLAS i gcomhar leis an Roinn Oideachais agus Scileanna, le fostóirí agus le ceardchumainn

source: An Apprenticeship Council has also been established
ga: Tá Comhairle Printíseachta curtha ar bun freisin

source: An apprenticeship provides on-the-job training with an employer
ga: Cuireann printíseacht oiliúint ar an láthair oibre le fostóir

source: An apprenticeship usually alternates between off-the-job training in an education centre and on-the-job training at your employer's workplace
ga: De ghnáth, athraíonn printíseacht idir oiliúint as an láthair oibre in ionad oideachais agus oiliúint ar an láthair oibre ag ionad oibre d’fhostóra

source: An apprenticeship generally lasts for 4 years, during which time you will spend 3 different periods in off-the-job training
ga: Maireann printíseacht 4 bliana de ghnáth a gcaithfear 3 thréimhse ar leith in oiliúint as an láthair oibre lena linn

source: Generally, the first off-the-job training phase will take place in an Education and Training Board (ETB) Training Centre while the subsequent off-the-job training phases will take place in an Institute of Technology
ga: Go ginearálta, beidh an chéad chéim d’oiliúint as an láthair oibre ar siúl in Ionad Oideachais de chuid Bord Oideachais agus Oiliúna (BOO) agus beidh na céimeanna d’oiliúint as an láthair oibre ina dhiaidh sin ar siúl in Institiúid Teicneolaíochta

source: The skills you develop will be assessed through on-the-job competence testing as well as off-the-job modular assessment and examinations and, if you complete these assessments successfully, you will be awarded an Advanced Certificate – craft (level 6)
ga: Déanfar na scileanna a fhorbraíonn tú a mheas trí thástáil inniúlachta ar an láthair oibre agus trí mheasúnú modúlach agus scrúduithe as an láthair oibre. Má chuireann tú na measúnuithe sin i gcrích go rathúil, bronnfar Ardteastas - ceird (leibhéal 6) ort

source: To be eligible for an apprenticeship, you must be at least 16 years of age and you are expected to have a minimum of grade D in 5 subjects in the Junior Certificate or equivalent exam
ga: Le bheith incháilithe le haghaidh printíseachta, caithfidh tú bheith 16 bliana d’aois ar a laghad agus táthar ag súil go bhfuil grád D ar a laghad agat i 5 ábhar sa Teastas Sóisearach nó i scrúdú coibhéiseach

source: However, if you don't have these qualifications, you can still register as an apprentice with an employer if you:
ga: Sa chás nach bhfuil na cáilíochtaí sin agat, áfach, féadfaidh tú clárú mar phrintíseacht le fostóir más rud é:

source: • Complete an approved preparatory training course followed by an assessment interview
ga: • Go gcuireann tú cúrsa oiliúna ullmhúcháin faofa i gcrích agus go ndéanann tú agallamh measúnachta ina dhiaidh sin

source: There is a specific preparatory training course available for people with disabilities
ga: Tá sainchúrsa oiliúna ullmhúcháin ar fáil do dhaoine faoi mhíchumas

source: • Are over 18 years of age and have at least 3 years of relevant work experience, in which case you will also be asked to do an assessment interview
ga: • Go bhfuil tú os cionn 18 bliana d’aois agus go bhfuil taithí oibre iomchuí 3 bliana ar a laghad agat. Sa chás sin, iarrfar ort dul faoi agallamh measúnachta freisin

source: You will be asked to pass a colour-vision test approved by for some apprenticeships
ga: Iarrfar ort pas a fháil i dtástáil dathamhairc atá faofa le haghaidh printíseachtaí áirithe

source: Generally an apprentice does not pay fees
ga: Go ginearálta, ní íocann printíseach táillí

source: However, the student contribution is levied on apprentices attending Institutes of Technology – this is usually the fourth and fifth phase of an apprenticeship
ga: Gearrtar ranníocaíocht mhac léinn ar phrintísigh, áfach, a fhreastalaíonn ar Institiúidí Teicneolaíochta – is gnách gurb é seo an ceathrú agus cúigiú céim de phrintíseacht

source: Apprentices are not eligible for the student grant
ga: Níl printísigh incháilithe an deontas mac léinn a fháil

source: The maximum rate of the student contribution for the academic year 2016-2017 is €3,000 - €1000 for apprentices attending phases no longer than 10-11 weeks
ga: Is é an ráta uasta den ranníocaíocht mhac léinn do bhliain acadúil 2016-2017 €3,000 sa bhliain - €1000 do phrintísigh a fhreastalaíonn ar chéimeanna nach faide ná na 10-11 sheachtain a bhíonn i gceist de ghnáth

source: The student contribution is apportioned for the time an apprentice spends in the Institute of Technology
ga: Déantar an ranníocaíocht mhac léinn a chionroinnt don am a chaitheann printíseach san Institiúid Teicneolaíochta

source: While you are training on the job, your employer will pay you a recommended apprenticeship wage
ga: Le linn duit bheith ag dul faoi oiliúint ar an láthair oibre, íocfaidh an fostóir pá molta printíseachta leat

source: If you are training in certain sectors, SOLAS pay a weekly allowance equivalent to that wage while you are training off the job
ga: Má tá tú ag dul faoi oiliúint in earnálacha áirithe, íocfaidh SOLAS liúntas seachtainiúil atá coibhéiseach leis an bpá sin agus tú ag dul faoi oiliúint as an láthair oibre

source: In all other industrial sectors, your off-the-job payments will be the responsibility of your employer, although SOLAS will contribute to any necessary travel and accommodation costs
ga: I ngach earnáil tionsclaíochta eile, is é d’fhostóir a bheidh freagrach as íocaíochtaí as an láthair oibre, ach déanfaidh SOLAS ranníocaíocht as aon taisteal riachtanach agus as aon chostais chóiríochta

source: If you are interested in taking up an apprenticeship contact the Apprenticeship Section of your local ETB
ga: Cuirfear agallamh ort chun an cúrsa a oireann is fearr do do riachtanais a shainaithint

source: You will be interviewed to identify the course that will best suit your needs
ga: De bharr an bhrú ar roinnt cúrsaí, d’fhéadfadh nach bhfaighfeá áit ar an gcúrsa is mian leat
